import tamil
# பைத்தானில் தமிழ் மொழியை உள்ளீடு செய்வதற்கு இது பயன்படுத்தப்பெற்றுள்ளது.

sentence = "சங்கம் சாதனை சிரிப்பு சீகை செம்மை சேவை ஈ ஊ சொவ்வாறு ஏ ஐ ஓ இவ்விடத்தில் சொல் சோறு கொல்லாது"
# இது தரவை உள்ளீடாய்த் தருவதற்குரிய பகுதி்.

உயிர்மெய்_முதலெழுத்து_சவரிசை=["ச", "சா", "சி", "சீ", "சு", "சூ", "செ", "சே", "சொ", "சோ"]

def uyirmei_sa_check(word, உயிர்மெய்_முதலெழுத்து_சவரிசை):
	first_letter=tamil.utf8.get_letters(word)[0]

	if first_letter in உயிர்மெய்_முதலெழுத்து_சவரிசை:
	
	    return True
	else:
	    return False
	    
for word in sentence.split():
	print(word, uyirmei_sa_check(word, உயிர்மெய்_முதலெழுத்து_சவரிசை))
	
# இது உயிர் எழுத்தில் முடியும் உயிர்மெய் எழுத்துக்களைப் பொருத்திப் பார்ப்பதற்குரிய நிரலாகும்.
# சொவ்வாறு True > False
# இதுகுறித்த தெளிவு தேவை. இதற்குப் புதியதாக விதி எழுதுதல் வேண்டும்.

