import tamil
# பைத்தானில் தமிழ் மொழியை உள்ளீடு செய்வதற்கு இது பயன்படுத்தப்பெற்றுள்ளது.

sentence = "அவன் ஒரூஉ அங்கு இவ்வாறு பேசும் ஆ ஈ ஊ ஏ ஐ ஓ இவ்விடத்தில் கருங்கண் காவேரி உள்ளது"
# இது தரவை உள்ளீடாய்த் தருவதற்குரிய பகுதி்.

உயிர்_முதலெழுத்து=["அ", "ஆ", "இ", "ஈ", "உ", "ஊ", "ஏ", "ஐ", "ஒ", "ஓ", "ஔ"]
def uyirezhuthu_check(word, உயிர்_முதலெழுத்து):
	first_letter=tamil.utf8.get_letters(word)[0]
	
	if first_letter in உயிர்_முதலெழுத்து:
	
	    return True
	else:
	    return False


for word in sentence.split():
	print(word, uyirezhuthu_check(word, உயிர்_முதலெழுத்து))
# இது உயிர் எழுத்தில் முடியும் உயிர்மெய் எழுத்துக்களைப் பொருத்திப் பார்ப்பதற்குரிய நிரலாகும்.
