# மொழியிறுதி எழுத்துக்கள்_தொல்காப்பியர்_விதி
# list
# word ending if condition
# சொல்லுக்கு இறுதியில் வரும் எழுத்துக்களை மொழி இறுதி எழுத்துக்கள் என்று கூறுவர். 
# மெய் எழுத்துகள் இயல்பாகவே சொல்லுக்கு இறுதியில் வரும். 
# சொல்லுக்கு இறுதியில் வரும் உயிர்மெய் எழுத்துக்களை உயிர் எழுத்துக்களாகவே கொள்ளவேண்டும் என்று இந்தப் பாடத்தின் முன்பகுதியில் படித்தது நினைவிருக்கிறதா? 
# சொல்லின் கடைசியில் (இறுதியில்) வரும் எழுத்துக்களை மொழி இறுதி எழுத்துக்கள் என்பர்.
# உயிர் எழுத்துகள்  -  12
# வல்லின மெய்      -  05
# இடையின மெய்   -  06
# மொத்தம்              -  23 # இந்த 23 எழுத்துகள் மட்டுமே தமிழ்ச்சொற்களின் இறுதியில் வரும்

import re, open-tamil # இது 'ரெகுலர் எக்சுபிரசன்' எனும் நிரல் மொழி இயங்குவதற்குரிய விதியாகும். 
# "open-tamil" இந்தக் குறிச்சொல் தமிழ்மொழியைப் புரிந்துகொள்வதற்கான நிரலாக்க அகராதியாகும்.

# தொல்._மொழியிறுதி_விதி 1 
# உயிர் எழுத்துக்கள் பன்னிரண்டும் சொல்லுக்கு இறுதியில் வரும். 
## உயிரெழுத்துக்கள்= 'அ','ஆ', 'இ', 'ஈ', 'உ','ஊ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ', 'ஔ'
## இந்த உயிர் எழுத்துக்கள் ஒரு சொல்லின் இறுதியில் வரும்பொழுது அதே வடிவத்துடன் வருவதில்லை. 
## அவ்வெழுத்துக்களின் ஒலிப்பே வருகின்றது.
## சான்றாக 'கற்க' என்ற சொல்லை எடுத்துக்கொள்வோம். இச்சொல்லைப் பிரிக்கும்பொழுது 'கற்+க(க்+அ)' என அமையும்.
## ஆக அதற்கு ஏற்ப விதி வகுத்தல் வேண்டும்.

def ():
  print('அ','ஆ', 'இ', 'ஈ', 'உ','ஊ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ', 'ஔ')

உயிரெழுத்துக்கள்()

உயிரெழுத்துக்கள் = ('அ','ஆ', 'இ', 'ஈ', 'உ','ஊ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ', 'ஔ')
உள்ளீட்டுக்குறிப்பு = int(input("தரவேண்டிய குறிப்பை உள்ளீடு செய்: ")
ஒப்பீட்டு_முடிவு = re.findall(r"உள்ளீட்டுக்குறிப்பு", உயிரெழுத்துக்கள்)
print(ஒப்பீட்டு_முடிவு)

உயிர் = r"அ\.?|ஆ\.?.|இ\.?|"

உள்ளீட்டுத்_தரவு = ("கற்க கசடற கற்பவை\n"
	"நிற்க")

matches = re.finditer(உயிர், உள்ளீட்டுத்_தரவு, re.MULTILINE)

for matchStr, match in enumerate(matches, start=1):
    
    print ("Match {matchStr} was found at {start}-{end}: {match}".format(matchStr = matchStr, start = match.start(), end = match.end(), match = match.group()))
    
    for groupStr in range(0, len(match.groups())):
        groupStr = groupStr + 1
        
        print ("Group {groupStr} found at {start}-{end}: {group}".format(groupStr = groupStr, start = match.start(groupStr), end = match.end(groupStr), group = match.group(groupStr)))
# தொல்._மொழியிறுதி_விதி 1.1
## எகரம் மட்டும் மெய்யோடு சேர்ந்து ஈறாகாது. உயிரளபெடையில் மட்டும் ஈறாகும். சான்று சேஎ (சேஎ-எருது). 
உயிரெழுத்துக்கள்_உயிரளபெடை='எ'
def உயிரெழுத்துக்கள்_உயிரளபெடை('எ'):
  print('எ' + " Refsnes")

my_function("Emil")
my_function("Tobias")
my_function("Linus")

# தொல்._மொழியிறுதி_விதி 1.2
## உயிர் எழுத்துகளில் நெட்டெழுத்துகள் ஏழு. இவற்றில் ஔகாரம் நீங்கலான ஏனை ஆறும் தனித்து வந்து ஈறாகும். 
## சான்று : பல (ல்+அ=ல) அணி (ண்+இ=ணி)
## சான்று : ஆ (பசு), ஈ, ஊ (மாமிசம்), ஏ (அம்பு), ஐ (தலைவன்), ஓ (மதகுப் பலகை)
உயிரெழுத்துக்கள்_நெடில்='ஆ', 'ஈ', 'ஊ', 'ஏ', 'ஐ', 'ஓ', 'ஔ'
print(உயிரெழுத்துக்கள்)
print(உயிரெழுத்துக்கள்)

#தொல்._மொழியிறுதி_விதி 1.3
## உயிர்க் குறில் (அ, இ, உ, எ, ஒ) ஐந்தும் அளபெடையின்போது சொல்லின் இறுதியில் வரும்.
உயிரெழுத்துக்கள்_குறில்_அளபெடை='அ', 'இ', 'உ', 'எ', 'ஒ'
print(உயிரெழுத்துக்கள்)
print(உயிரெழுத்துக்கள்)


# தொல்._மொழியிறுதி_விதி 1.4
# உயிர் எழுத்துகளில் குற்றெழுத்துகள் ஐந்து, இவற்றில் ‘அ, இ, உ’ என்பன சுட்டு எழுத்துகள்; ‘எ’ என்பது வினா எழுத்து. 
# இவை நான்கும் நிலைமொழியாக வரும்போது அம்மொழியின் ஈற்று எழுத்தாகக் கருதப்படும்.
## சான்று : அ+பொருள் = அப்பொருள், இ+பொருள் = இப்பொருள், எ+பொருள் = எப்பொருள்
உயிரெழுத்துக்கள்_குறில்_சுட்டு = 'அ', 'இ', 'உ'
உயிரெழுத்துக்கள்_குறில்_வினா = 'எ'
print(உயிரெழுத்துக்கள்)
print(உயிரெழுத்துக்கள்)

# தொல்._மொழியிறுதி_விதி 1.5
## உயிர் எழுத்துக்கள் மொழிக்கு இறுதியில் வரும்போது பெரும்பாலும் மெய்யோடு சேர்ந்தே வரும். அஃதாவது உயிர்மெய்யாகவே வரும்.
 

# தொல்._மொழியிறுதி_விதி 2 - 4
# மெய் எழுத்துக்கள் பதினெட்டு. 
# இவற்றில் வல்லின எழுத்துகளாகிய ‘க், ச், ட், த், ப், ற்’ என்னும் ஆறும், மெல்லின எழுத்துகளில் ‘ங் ’ என்னும் ஒன்றும் ஆகிய ஏழும் மொழிக்கு இறுதியில் வராது. 
# மெல்லின எழுத்துகளில் ஞ், ண், ந், ம், ன்’ என்னும் ஐந்தும், இடையின எழுத்துக்களாகிய ‘ய், ர், ல், வ், ழ், ள்’ என்னும் ஆறும் ஆகிய பதினொன்று மட்டுமே மொழிக்கு இறுதியில் வரும். 
# இவற்றுள் ‘ஞ், ந், வ்’ ஆகிய மூன்றும் நன்னூலார் காலத்தில் குறிப்பிட்ட ஒரு சில சொற்களில் மட்டுமே மொழிக்கு இறுதியில் வந்தன. 
# ‘ஞ்’ என்பது உரிஞ் (தேய்த்தல்) என்னும் ஒரு சொல்லில் மட்டும் இறுதியில் வந்தது; 
# ‘ந்’ என்பது பொருந் (ஒத்திருத்தல்), வெரிந் (முதுகு) என்னும் இருசொற்களில் மட்டும் இறுதியில் வந்தது; 
# ‘வ்’ என்பது அவ், இவ், உவ், தெவ் (பகை) என்னும் நான்கு சொற்களில் மட்டுமே இறுதியில் வந்தது. இச்சொற்கள் இக்காலத் தமிழில் இல்லை.

# வல்லினம், மெல்லினம், இடையினம் என்று மெய் எழுத்துக்கள் மூன்று வகைப்படும். 

# தொல்._மொழியிறுதி_விதி 2
# இவற்றில் வல்லின மெய் எழுத்துக்கள் சொல்லுக்கு இறுதியில் வருவது இல்லை.
வல்லின_எழுத்துக்கள்=['க்','ச்', 'ட்', 'த்', 'ப்','ற்']
def வல்லின_எழுத்துக்கள்():
	print()

# தொல்._மொழியிறுதி_விதி 3
# மெல்லின மெய் எழுத்துக்கள் ஐந்தும், இடையின மெய் எழுத்துக்கள் ஆறும் சொல்லுக்கு இறுதியில் வரும்.
# மெல்லின மெய் எழுத்துக்களில் ஞ், ண், ந், ம், ன் ஆகிய ஐந்தும் சொல்லுக்கு இறுதியில் வரும்.

# தொல்._மொழியிறுதி_விதி 4
# இடையின மெய் எழுத்துகள் ஆறும் (ய், ர், ல், வ், ழ், ள்) சொல்லுக்கு இறுதியில் வரும்.


# குறில் எழுத்துகள் மட்டுமன்றி ஏனைய உயிர் எழுத்துகளும் மெய்யுடன் இணைந்து உயிர்மெய்யாக மொழி இறுதியில் வரும்.
# சில, பலா, கிளி, தீ, சுடு, பூ, சே(ஒருவகை மரம்), தே(தெய்வம்), மலை, நொ(துன்பம்), போ, கௌ(கவ்வுதல்)

# ஞ், ண், ந், ம், ய், ர், ல், வ், ழ், ள், ன் ஆகிய பதினொரு மெய்யெழுத்துகளும் மொழியின் இறுதியில் வரும்.
# உரிஞ், மண், வெரிந்(முதுகு), மரம், காய், வேர், வேல், தெவ்(பகை), வாழ், வாள், பொன்




