# அகர இறுதிப் பெயர் நிலை முன்னர்
# வேற்றுமை அல்வழி க ச த ப தோன்றின்
# தம்தம் ஒத்த ஒற்று இடை மிகுமே. 1

# நிலைமொழியில் அகர ஈற்றுச் சொற்கள் நிற்க (விள), 
# வருமொழி முதலில் க, ச, த, ப எழுத்துக்களில் தொடங்கும் சொற்கள் (+ குறிது, + சிறிது, + பெரிது) வரும் பொழுது
# வல்லினம் மிகும் (க், ச், த், ப்) 
# விள + குறிது = விளக்குறிது
1. செய்யிய என்னும் வாய்பாட்டு வினையெச்சங்களின் முன்னர் வரும் வல்லினம் (க, ச, த, ப) இயல்பாகும்.

சான்று:

காணிய + சென்றான்
= காணிய சென்றான் (காண்பதற்குச் சென்றான்)
உண்ணிய + போனான்
= உண்ணிய போனான் (உண்பதற்குப் போனான்)
2. பல வகைப்பட்ட அகர ஈற்றுப் பெயரெச்சங்களுக்கு முன்னர் வரும் வல்லினம் இயல்பாகும்.

சான்று:

உண்ட + பையன்
= உண்ட பையன் (தெரிநிலைப்
        பெயரெச்சம்)
கரிய + பையன்
= கரிய பையன் (குறிப்புப்
        பெயரெச்சம்)
அறியாத + பையன்
= அறியாத பையன் (எதிர்மறைப்
        பெயரெச்சம்)
3. பல வகைப்பட்ட அகர ஈற்று வினைமுற்றுகளுக்கு முன்னர் வரும் வல்லினம் இயல்பாகும்.

சான்று:

உண்டன + குதிரைகள்
= உண்டன குதிரைகள் (தெரிநிலை வினைமுற்று)
கரியன + குதிரைகள்
= கரியன குதிரைகள் (குறிப்பு வினைமுற்று)
வாழ்க + தலைவா
= வாழ்க தலைவா (வியங்கோள் வினைமுற்று)
4. ஆறாம் வேற்றுமைப் பன்மை உருபாகிய ‘அ’ என்பது பெயரைச் சார்ந்து வரும்போது அதன் முன்னர் வரும் வல்லினம் இயல்பாகும்.

சான்று:

என + அ + கைகள் = என கைகள் (என்னுடைய கைகள்)

5. அகர ஈற்றுப் பன்மைப் பெயர்களுக்கு முன்னர் வரும் வல்லினம் இயல்பாகும்.

சான்று:

பல + குதிரைகள் = பல குதிரைகள்
சில + தந்தான் = சில தந்தான்

6. ‘அம்ம’ என்னும் உரையசை இடைச்சொல்லுக்கு முன்னர் வரும் வல்லினம் இயல்பாகும்.

சான்று:

அம்ம கண்ணா

(அம்ம என்னும் இடைச்சொல், ஒருவனை ஒருவன் ஒன்றுகேள் என்று சொல்லுதற்கண் வரும் என்பர் தொல்காப்பியர். அம்ம கேட்பிக்கும் - (தொல், சொல், 276)

மேலே கூறப்பட்ட புணர்ச்சி விதிகளை நன்னூலார் உயிர் ஈற்றுப் புணரியலில் பின்வரும் நூற்பாவில் குறிப்பிடுகிறார் :

செய்யிய என்னும் வினையெச்சம், பல்வகைப்
பெயரின் எச்சம், முற்று, ஆறன் உருபே,
அஃறிணைப் பன்மை, அம்ம முன் இயல்பே  (நன்னூல், 167)

‘சாவ’ என்னும் சொல்லின் முன் வல்லினம்
‘சாவ’ என்பது செய என்னும் வாய்பாட்டு வினையெச்சம் ஆகும். இதனுடைய ஈற்றில் உள்ள வகர உயிர்மெய்யானது, வருமொழி முதலில் வல்லினம் வரும் போது கெடுதலும் (நீங்குதலும்) விதியாம்.

சாவ என் மொழிஈற்று உயிர்மெய் சாதலும் விதி (நன்னூல், 169)

சான்று:

சாவ + குத்தினான் = சாக்குத்தினான் - (சாகும்படி குத்தினான்)

‘இயல்பினும் விதியினும்’ என்ற பொதுவிதிப்படி, ‘சாவ + குத்தினான் = சாவக் குத்தினான்’ என வல்லினம் மிகும். சாவ என்னும் இச்சொல் செய்யுளில் ‘சா’ என இறுதி வகர உயிர்மெய் நீங்கி அமைதலும் உண்டு. அப்போது சா என நின்றாலும் வருமொழி முதலில் உள்ள வல்லினத்தோடு புணரும்போது சாக்குத்தினான் என வல்லினம் மிகுந்தே வரும். இதுவே விதி என நூற்பாவில் கூறப்படுகிறது.

பல, சில என்னும் சொற்கள் புணரும் முறை
1. பல, சில என்னும் இருசொற்களும் தமக்குமுன் தாமே வருமாயின் (பல என்பதற்கு முன் பல என்பதும், சில என்பதற்கு முன் சில என்பதும் வந்தால்), இயல்பாதலும், வல்லினம் மிகுதலும், நிலைமொழி இறுதியில் நின்ற அகரம் கெட, லகர மெய் றகர மெய்யாகத் திரிதலும் உண்டு.

சான்று:

பல + பல	= பலபல		இயல்பாயின
சில + சில	= சிலசில
 	 	 	 
பல + பல	= பலப்பல		வல்லினம் மிக்கன
சில + சில	= சிலச்சில
 	 	 	 
பல + பல	= பற்பல		அகரம் கெட லகரம் றகரம் ஆயிற்று
சில + சில	= சிற்சில
2. பல, சில என்னும் இருசொற்களின் முன்னர், நாற்கணத்தில் தொடங்கும் சொற்கள் வரின், அவ்விரு சொற்களின் ஈற்றில் உள்ள அகரம் நிற்பதும் உண்டு; நீங்குவதும் உண்டு.

சான்று:

பல + ஆண்டு = பலவாண்டு, பல்லாண்டு
பல + கலை = பலகலை, பல்கலை
சில + நாள் = சிலநாள், சின்னாள் (சில் + நாள்)
பல + வகை = பலவகை , பல்வகை

நூற்பா:

பல சில எனும்இவை தம்முன் தாம்வரின்
இயல்பும், மிகலும், அகரம் ஏக
லகரம் றகரம் ஆகலும், பிறவரின்
அகரம் விகற்பம் ஆகலும் உளபிற        (நன்னூல், 170)
